kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_Init()
{
	uint8_t i;
	for (i = 0; i < IOCX_NUM_INTERRUPTS; i++) {
		IOCX_gpio_pin_to_interrupt_index_map[i] = INVALID_INTERRUPT_INDEX;
		IOCX_gpio_interrupt_timer_reset_targets[i] = TIMER_RESET_DISABLED;
	}
	for (i = 0; i < IOCX_NUM_GPIOS; i++) {
		if (gpio_channels[i].interrupt_type == INT_EXTI) {
			IOCX_gpio_pin_to_interrupt_index_map[POSITION_VAL(gpio_channels[i].pin)] = gpio_channels[i].interrupt_index;
			IOCX_gpio_pin_to_gpio_channel_index_map[POSITION_VAL(gpio_channels[i].pin)] = i;
			IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[i].pin)] = 0;
			attachInterrupt(gpio_channels[i].pin, &HAL_IOCX_EXTI_ISR, FALLING);
		} else if (gpio_channels[i].interrupt_type == INT_ALTPIN) {
			IOCX_gpio_pin_to_interrupt_index_map[POSITION_VAL(altint_pin)] = gpio_channels[i].interrupt_index;
			IOCX_gpio_pin_to_gpio_channel_index_map[POSITION_VAL(altint_pin)] = i;
			IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = 0;
			attachInterrupt(altint_pin, &HAL_IOCX_EXTI_ISR, FALLING);
		}
	}
	DWT_Init();	/* Initialize microsecond delay ARM DWT mechanism. */
}

void HAL_IOCX_Ext_Power_Enable(int enable)
{
	HAL_GPIO_WritePin(EXT_PWR_SWITCH_ON_GPIO_Port, EXT_PWR_SWITCH_ON_Pin,
			(enable ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

void HAL_IOCX_RPI_GPIO_Driver_Enable(int enable)
{
	  HAL_GPIO_WritePin(_RPI_GPIO_OE1_GPIO_Port, _RPI_GPIO_OE1_Pin,
			  (enable ? GPIO_PIN_RESET : GPIO_PIN_SET));
	  HAL_GPIO_WritePin(_RPI_GPIO_OE2_GPIO_Port, _RPI_GPIO_OE2_Pin,
			  (enable ? GPIO_PIN_RESET : GPIO_PIN_SET));
}

void HAL_IOCX_RPI_COMM_Driver_Enable(int enable)
{
	  HAL_GPIO_WritePin(COMM_OE2_GPIO_Port, COMM_OE2_Pin,
			  (enable ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

/* Returns 0 if pins are input, non-zero if output */
int HAL_IOCX_RPI_GPIO_Output()
{
	if (HAL_GPIO_ReadPin(RPI_GPIO_DIR_IN_GPIO_Port, RPI_GPIO_DIR_IN_Pin) == GPIO_PIN_SET) {
		return 1;
	}
	return 0;
}

/* Returns 0 if no ext power fault has occurred, non-zero indicates fault has occurred. */
int HAL_IOCX_Ext_Power_Fault()
{
	if (HAL_GPIO_ReadPin(_IO_POWER_FAULT_GPIO_Port, _IO_POWER_FAULT_Pin) == GPIO_PIN_RESET) {
		return 1;
	}
	return 0;
}

/* IOCX GPIO Interrupt Generation:
 *
 * Each of the 16 IOCX GPIO Pins (12 Digital + 4 Analog when Triggers are Used)
 * may be optionally configured to generate an interrupt.  This is managed
 * by a simple mechanism consisting of:
 *
 * - Interrupt Mask
 * - Interrupt Status
 * - Interrupt Assertion GPIO Pin (Active Low)
 *
 * Two separate interrupt "edge detection" methods are used:
 *
 * 1) IOCX Hardware Interrupts:
 *
 * An ISR handles STM32 EXTI interrupts on configured GPIO edges.
 *
 * 3) Analog Triggering:
 *
 * The VMX Analog Triggers may be used to detect edges on any of the
 * VMX Analog Inputs, and are implemented external to this file. An
 * interface is provided allowing GPIO Interrupt Assertion/Deassertion
 * in these cases.
 */

void HAL_IOCX_AssertInterruptSignal()
{
	/* Assert Interrupt Pin */
	HAL_GPIO_WritePin(NAVX_2_RPI_INT4_GPIO_Port, NAVX_2_RPI_INT4_Pin,GPIO_PIN_RESET);
}

/* Todo:  For performance, inline and move these to header file. */
void HAL_IOCX_AssertInterrupt(uint16_t int_status_bit)
{
	if (int_status_bit & int_mask) {
		uint8_t gpio_index;
		int_status |= int_status_bit;
		HAL_IOCX_AssertInterruptSignal();
		// Clear timer counter, if configured to do so
		gpio_index = POSITION_VAL(int_status_bit);
		if (gpio_index < IOCX_NUM_INTERRUPTS) {
			uint8_t timer_index = IOCX_gpio_interrupt_timer_reset_targets[gpio_index];
			if (timer_index != TIMER_RESET_DISABLED) {
				uint8_t reset_control;
				iocx_encode_timer_counter_reset(&reset_control, RESET_REQUEST);
				HAL_IOCX_TIMER_Set_Control(timer_index, &reset_control);
			}
		}
	}
}

void HAL_IOCX_DeassertInterruptSignal()
{
	HAL_GPIO_WritePin(NAVX_2_RPI_INT4_GPIO_Port, NAVX_2_RPI_INT4_Pin,GPIO_PIN_SET);
}

void HAL_IOCX_DeassertInterrupt(uint16_t int_bits_to_clear) {
	int_status &= ~int_bits_to_clear;
	if (!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	}
}

void HAL_IOCX_UpdateInterruptMask(uint16_t int_bits) {
	int_mask = int_bits;
	/* If all actively assert interrupts are now masked    */
	/* then deassert the interrupt signal, and vice versa. */
	if(!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	} else {
		HAL_IOCX_AssertInterruptSignal();
	}
	/* TOdo:  use mask in GPIO EXTI ISRs to avoid unnecessary dispatch */
}

uint16_t HAL_IOCX_GetInterruptMask() {
	return int_mask;
}

uint16_t HAL_IOCX_GetInterruptStatus() {
	return int_status;
}

uint16_t HAL_IOCX_GetLastInterruptEdges() {
	return last_int_edge;
}

/***************************************************************************/
/* Timer section                                                           */
/*                                                                         */
/* Each timer is clocked off of either APB1 or APB2, as follows:           */
/*                                                                         */
/* APB1 Timer Clocks:  48Mhz (TIM1, TIM9, TIM10, TIM11)					   */
/* APB2 Timer Clocks:  96Mhz (TIM2, TIM3, TIM4, TIM5)					   */
/*																		   */
/* To keep things uniform, all 96Mhz clock sources use an internal         */
/* (/2) divider - thus all clocks operate at a clock frequency (fTIM) of   */
/* 48Mhz.                                                                  */
/***************************************************************************/

TIM_HandleTypeDef htim1 = {TIM1};
TIM_HandleTypeDef htim2 = {TIM2};
TIM_HandleTypeDef htim3 = {TIM3};
TIM_HandleTypeDef htim4 = {TIM4};
TIM_HandleTypeDef htim5 = {TIM5};
TIM_HandleTypeDef htim9 = {TIM9};

#define NUM_IOCX_QUAD_ENCODERS 5

int qe_enabled[NUM_IOCX_QUAD_ENCODERS] = { 0, 0, 0, 0, 0 };

int qe_curr_mode[NUM_IOCX_QUAD_ENCODERS] = {
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
};
uint16_t qe0_last_count = 0;
uint32_t qe1_last_count = 0;
uint16_t qe2_last_count = 0;
uint16_t qe3_last_count = 0;
uint32_t qe4_last_count = 0;

volatile int32_t qe_total_count[NUM_IOCX_QUAD_ENCODERS] = { 0, 0, 0, 0, 0 };

#define SYSTICK_HANDLER_PROCESSING_FREQUENCY 2 /* Every other tick */
#define NUM_QE_COUNT_DELTAS 25
#define QE_COUNT_DELTA_PERIOD_MS (NUM_QE_COUNT_DELTAS * SYSTICK_HANDLER_PROCESSING_FREQUENCY)

volatile uint16_t qe_count_index = 0; // Range 0 - (NUM_QE_COUNT_DELTAS-1)
volatile int16_t qe_count_deltas[NUM_IOCX_QUAD_ENCODERS][NUM_QE_COUNT_DELTAS];
volatile uint32_t qe_last_delta_timestamp[NUM_IOCX_QUAD_ENCODERS];

static uint32_t GetTotalQECountDelta(uint8_t qe_index) {
	if (qe_index >= NUM_IOCX_QUAD_ENCODERS) return 0;

