kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
    uint32_t total_qe_count_delta = 0;
	NVIC_DisableIRQ(SysTick_IRQn);
	volatile int16_t *p_count_deltas = &qe_count_deltas[qe_index][qe_count_index];
    int i;
	for (i = qe_count_index; i < NUM_QE_COUNT_DELTAS; i++) {
    	total_qe_count_delta += abs(*p_count_deltas);
    	p_count_deltas++;
    }
    p_count_deltas = &qe_count_deltas[qe_index][0];
    for (i = 0; i < qe_count_index; i++) {
    	total_qe_count_delta += abs(*p_count_deltas);
    	p_count_deltas++;
    }
    NVIC_EnableIRQ(SysTick_IRQn);
    return total_qe_count_delta;
}

static uint16_t GetRecentQEPulseLengthMicrosecondsAverage(uint8_t qe_index) {
	if (qe_index >= NUM_IOCX_QUAD_ENCODERS) return 0;

	uint32_t qe_count = GetTotalQECountDelta(qe_index);
	uint32_t qe_count_per_sec = qe_count * (1000 / QE_COUNT_DELTA_PERIOD_MS);
	uint32_t qe_pulse_per_sec;
	switch (qe_curr_mode[qe_index]) {
	default:
	case QUAD_ENCODER_MODE_4x:
		qe_pulse_per_sec = qe_count_per_sec / 4;
		break;
	case QUAD_ENCODER_MODE_2x:
		qe_pulse_per_sec = qe_count_per_sec / 2;
		break;
	case QUAD_ENCODER_MODE_1x:
		qe_pulse_per_sec = qe_count_per_sec;
		break;
	}
	uint32_t qe_pulse_avg_microseconds =
			(uint32_t)1000000 / qe_pulse_per_sec;
	return (uint16_t)qe_pulse_avg_microseconds;
}

static int QEIntegratorEnabled(uint8_t qe_index) {
	if (qe_index < NUM_IOCX_QUAD_ENCODERS) {
		return qe_enabled[qe_index];
	} else {
		return 0;
	}
}

static void ResetQEIntegrator(uint8_t qe_index, int enabled) {
	if (qe_index < NUM_IOCX_QUAD_ENCODERS) {
        NVIC_DisableIRQ(SysTick_IRQn);
		qe_enabled[qe_index] = enabled;
		qe_total_count[qe_index] = 0;
		switch (qe_index) {
		case 0:  qe0_last_count = 0; break;
		case 1:  qe1_last_count = 0; break;
		case 2:  qe2_last_count = 0; break;
		case 3:  qe3_last_count = 0; break;
		case 4:  qe4_last_count = 0; break;
		default: break;
		}
        NVIC_EnableIRQ(SysTick_IRQn);
	}
}

// Systick interrupt handler (invoked every millisecond).
// To limit system processing overhead, this handler only performs
// processing at a tick frequency of SYSTICK_HANDLER_PROCESSING_FREQUENCY
void HAL_IOCX_SysTick_Handler()
{
	uint32_t ts_now = HAL_GetTick();
	if ((ts_now % SYSTICK_HANDLER_PROCESSING_FREQUENCY) != 0) return;

	/* NOTE:  Timers 1, 3, 4 are 16-bit; Timers 2, 5 are 32-bit. */
	if (qe_enabled[0]) {
		uint16_t qe0_curr_count = (uint16_t)TIM1->CNT;
		int16_t count_delta = (int16_t)(qe0_curr_count - qe0_last_count);
		qe_total_count[0] += count_delta;
		qe0_last_count = qe0_curr_count;
		qe_count_deltas[0][qe_count_index] = count_delta;
		if (count_delta != 0) {
			qe_last_delta_timestamp[0] = ts_now;
		}
	}
	if (qe_enabled[1]) {
		uint32_t qe1_curr_count = (uint32_t)TIM2->CNT;
		int16_t count_delta = (int16_t)(qe1_curr_count - qe1_last_count);
		qe_total_count[1] += count_delta;
		qe1_last_count = qe1_curr_count;
		qe_count_deltas[1][qe_count_index] = count_delta;
		if (count_delta != 0) {
			qe_last_delta_timestamp[1] = ts_now;
		}
	}
	if (qe_enabled[2]) {
		uint16_t qe2_curr_count = (uint16_t)TIM3->CNT;
		int16_t count_delta = (int16_t)(qe2_curr_count - qe2_last_count);
		qe_total_count[2] += count_delta;
		qe2_last_count = qe2_curr_count;
		qe_count_deltas[2][qe_count_index] = count_delta;
		if (count_delta != 0) {
			qe_last_delta_timestamp[2] = ts_now;
		}
	}
	if (qe_enabled[3]) {
		uint16_t qe3_curr_count = (uint16_t)TIM4->CNT;
		int16_t count_delta = (int16_t)(qe3_curr_count - qe3_last_count);
		qe_total_count[3] += count_delta;
		qe3_last_count = qe3_curr_count;
		qe_count_deltas[3][qe_count_index] = count_delta;
		if (count_delta != 0) {
			qe_last_delta_timestamp[3] = ts_now;
		}
	}
	if (qe_enabled[4]) {
		uint32_t qe4_curr_count = (uint32_t)TIM5->CNT;
		int16_t count_delta = (int16_t)(qe4_curr_count - qe4_last_count);
		qe_total_count[4] += count_delta;
		qe4_last_count = qe4_curr_count;
		qe_count_deltas[4][qe_count_index] = count_delta;
		if (count_delta != 0) {
			qe_last_delta_timestamp[4] = ts_now;
		}
	}
	if (qe_count_index >= NUM_QE_COUNT_DELTAS) {
		qe_count_index = 0;
	} else {
		qe_count_index++;
	}
}

typedef struct {
	TIM_HandleTypeDef *p_tim_handle;
	uint32_t core_clock_divider;
	uint32_t first_channel_number;
	uint32_t second_channel_number;
	uint32_t max_auto_reload_value;
	int cc_irqn;
} Timer_Config;

static Timer_Config timer_configs[IOCX_NUM_TIMERS] =
{
	{&htim1, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM1_CC_IRQn},
	{&htim2, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFFFFFF, TIM2_IRQn},
	{&htim3, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM3_IRQn},
	{&htim4, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM4_IRQn},
	{&htim5, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFFFFFF, TIM5_IRQn},
	{&htim9, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM1_BRK_TIM9_IRQn},
};

uint8_t curr_timer_cfg[IOCX_NUM_TIMERS]; /* All defaults have 0 value (disabled) */

uint16_t timer_channel_ccr[IOCX_NUM_TIMERS][IOCX_NUM_CHANNELS_PER_TIMER];

uint32_t timer_last_capture_interrupt_timestamp_ms[IOCX_NUM_TIMERS];

typedef struct {
	TIMER_COUNTER_CLK_SOURCE clk_source;
	TIMER_COUNTER_DIRECTION direction;
	TIMER_SLAVE_MODE slavemode;
	TIMER_SLAVE_MODE_TRIGGER_SOURCE slavemode_trigger;
	uint32_t stall_timeout_ms;
	TIMER_INPUT_CAPTURE_STALL_ACTION stall_action;
} Timer_InputCap_Config;

static Timer_InputCap_Config timer_inputcap_configs[IOCX_NUM_TIMERS] =
{
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
	{ TIMER_COUNTER_CLK_INTERNAL, TIMER_COUNTER_DIRECTION_UP, TIMER_SLAVE_MODE_DISABLED,
			TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1, 0, TIMER_STALL_ACTION_NONE },
};

