kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
typedef struct {
	TIMER_INPUT_CAPTURE_CH_SOURCE source;
	TIMER_INPUT_CAPTURE_CH_ACTIVE_EDGE active_edge;
	TIMER_INPUT_CAPTURE_CH_PRESCALER prescaler;
	TIMER_INPUT_CAPTURE_CH_FILTER filter;
} Timer_InputCap_Channel_Config;

static Timer_InputCap_Channel_Config timer_input_ch_configs[IOCX_NUM_TIMERS][IOCX_NUM_CHANNELS_PER_TIMER] =
{
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
	{{INPUT_CAPTURE_FROM_SIGNAL_A, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x },
	 {INPUT_CAPTURE_FROM_SIGNAL_B, INPUT_CAPTURE_CH_ACTIVE_RISING, INPUT_CAPTURE_PRESCALE_1x, INPUT_CAPTURE_CH_FILTER_16x }},
};

void HAL_IOCX_GPIO_Set_Config(uint8_t gpio_index, uint8_t config) {

	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;

	/* Before configuring, deinit; this clears the GPIO to default state */
	HAL_GPIO_DeInit(gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin);
	IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[gpio_index].pin)] = 0;
	if (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN ) {
		/* Deinit the altpin gpio */
		HAL_GPIO_DeInit(p_altint_port, altint_pin);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = 0;
	}

	IOCX_GPIO_TYPE type = iocx_decode_gpio_type(&config);
	IOCX_GPIO_INPUT input = iocx_decode_gpio_input(&config);
	IOCX_GPIO_INTERRUPT interrupt_mode = iocx_decode_gpio_interrupt(&config);

	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	GPIO_InitStruct.Pin = gpio_channels[gpio_index].pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;

	GPIO_InitTypeDef GPIO_InitStructAltpin;
	int altpin_int_enabled = 0;

	switch(type){
	case GPIO_TYPE_INPUT:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		/* Enable the Pin as Input */
		switch(input){
		default:
		case GPIO_INPUT_FLOAT:
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			break;
		case GPIO_INPUT_PULLUP:
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			break;
		case GPIO_INPUT_PULLDOWN:
			GPIO_InitStruct.Pull = GPIO_PULLDOWN;
			break;
		}
		if((gpio_channels[gpio_index].interrupt_type == INT_EXTI) ||
		   (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN)) {
			switch(interrupt_mode) {
			case GPIO_INTERRUPT_RISING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING;
				break;
			case GPIO_INTERRUPT_FALLING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_FALLING;
				break;
			case GPIO_INTERRUPT_BOTH_EDGES:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING_FALLING;
				break;
			case GPIO_INTERRUPT_DISABLED:
				break;
			}
		}
		if (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN) {
			GPIO_InitStructAltpin.Speed = GPIO_InitStruct.Speed;
			GPIO_InitStructAltpin.Pin = altint_pin;
			GPIO_InitStructAltpin.Mode = GPIO_InitStruct.Mode;
			GPIO_InitStructAltpin.Pull = GPIO_InitStruct.Pull;
			altpin_int_enabled = 1;
		}
		break;
	case GPIO_TYPE_OUTPUT_PUSHPULL:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_OUTPUT_OPENDRAIN:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_AF:
		if ( gpio_channels[gpio_index].alt_function <= MAX_VALID_STM32_AF_VALUE ) {
			GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
			GPIO_InitStruct.Alternate = gpio_channels[gpio_index].alt_function;
		} else {
			GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
			GPIO_InitStruct.Pull = GPIO_PULLDOWN; // ???
			// TODO:  Enable Interrupt if alt_function == GPIO_AF_SW_RESET_COUNTER
			// TODO:  Enable Software function
		}
		/* TODO:  If the timer is running, stop it? */
		/* TODO:  If the timer was stopped above, restart it? */
		break;
	case GPIO_TYPE_DISABLED:
	default:
		// TODO:  If a software alternate function, disable that function
		return;
	}
	if (!altpin_int_enabled) {
		HAL_GPIO_Init(gpio_channels[gpio_index].p_gpio, &GPIO_InitStruct);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[gpio_index].pin)] = GPIO_InitStruct.Mode;
	} else {
		HAL_GPIO_Init(p_altint_port, &GPIO_InitStructAltpin);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = GPIO_InitStructAltpin.Mode;
	}
}

void HAL_IOCX_GPIO_Get(uint8_t first_gpio_index, int count, uint8_t *values)
{
	int i;
	if ( first_gpio_index > (IOCX_NUM_GPIOS-1) ) return;
	if ( first_gpio_index + count > IOCX_NUM_GPIOS) {
		count = IOCX_NUM_GPIOS - first_gpio_index;
	}
	for ( i = first_gpio_index; i < first_gpio_index + count; i++ ) {
		*values++ = (HAL_GPIO_ReadPin(gpio_channels[i].p_gpio, gpio_channels[i].pin) == GPIO_PIN_SET) ?
			IOCX_GPIO_SET : IOCX_GPIO_RESET;
	}
}

/* Requested GPIO state is lowest bit (1:  HIGH; 0:  LOW).                    */
/* If upper 7 bits are not zero, a pulse is generated, and these bits define  */
/* the pulse period (in microseconds).                                        */
void HAL_IOCX_GPIO_Set(uint8_t gpio_index, uint8_t value)
{
	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;

	int requested_level = value & 0x01;
	uint8_t pulse_length_microseconds = value >> 1;

	if (pulse_length_microseconds > 0) {
		HAL_IOCX_GPIO_Pulse(gpio_index, requested_level, pulse_length_microseconds);
	} else {
		HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
    		(requested_level != IOCX_GPIO_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET);
	}
}

