kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
/* Generates a GPIO pulse, as follows: */
/* - If current state is same as pulse level, force GPIO to opposite state, wait 1 us.    */
/* - Then, set the GPIO to the requested state.                                           */
/* - Then, delay (blocking) the requested number of microseconds.                         */
/* - Finally, set the GPIO to the opposite of the requested state.                        */
void HAL_IOCX_GPIO_Pulse(uint8_t gpio_index, int high, uint8_t pulse_length_microseconds)
{
	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;
	GPIO_PinState new_gpio_state = (high ? GPIO_PIN_SET : GPIO_PIN_RESET);

	/* Force a leading edge transition, for a minimum of 1 microsecond */
	GPIO_PinState curr_gpio_state =
			HAL_GPIO_ReadPin(gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin);
	if (curr_gpio_state == new_gpio_state) {
		HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
				(new_gpio_state == IOCX_GPIO_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET);
		DWT_Delay(1);
	}

	/* Begin pulse */
	HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
			(new_gpio_state == IOCX_GPIO_SET) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	/* Delay */
	if (pulse_length_microseconds > 0) {
		DWT_Delay(pulse_length_microseconds);
	}

	/* End Pulse */
	HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
		(new_gpio_state == IOCX_GPIO_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void HAL_IOCX_TIMER_Enable_Clocks(uint8_t timer_index, int enable)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	switch(timer_index){
	case 0: enable ? __TIM1_CLK_ENABLE() : __TIM1_CLK_DISABLE(); break;
	case 1: enable ? __TIM2_CLK_ENABLE() : __TIM2_CLK_DISABLE(); break;
	case 2: enable ? __TIM3_CLK_ENABLE() : __TIM3_CLK_DISABLE(); break;
	case 3: enable ? __TIM4_CLK_ENABLE() : __TIM4_CLK_DISABLE(); break;
	case 4: enable ? __TIM5_CLK_ENABLE() : __TIM5_CLK_DISABLE(); break;
	case 5: enable ? __TIM9_CLK_ENABLE() : __TIM9_CLK_DISABLE(); break;
	}
}

#define BOTH_ENCODER_TIMER_CHANNELS 0xFF /*(TIM_CHANNEL_1 and TIM_CHANNEL_2)*/

/* Timer Capture Complete Interrupt Service Routine Callback */
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *p_htim) {
	int i;
	for ( i = 0; i < IOCX_NUM_TIMERS; i++ ) {
		if (p_htim == timer_configs[i].p_tim_handle) {
			timer_last_capture_interrupt_timestamp_ms[i] = HAL_GetTick();
			break;
		}
	}
}

void HAL_IOCX_TIMER_ConfigureInterruptPriorities(uint8_t timer_index) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
    HAL_NVIC_SetPriority(cc_irqn, 7, 0);
}

void HAL_IOCX_TIMER_Enable_Capture_Interrupt(uint8_t timer_index, int enable) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
	if (enable) {
		HAL_NVIC_EnableIRQ(cc_irqn);
	} else {
		HAL_NVIC_DisableIRQ(cc_irqn);
	}
}

void HAL_IOCX_TIMER_Set_Counter_Cfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].clk_source = iocx_ex_timer_decode_counter_clk_src(&config);
	timer_inputcap_configs[timer_index].direction = iocx_ex_timer_decode_counter_direction(&config);
}

void HAL_IOCX_TIMER_Set_SlaveMode_Cfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].slavemode = iocx_ex_timer_decode_slavemode(&config);
	timer_inputcap_configs[timer_index].slavemode_trigger = iocx_ex_timer_decode_slavemode_trigger_source(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_Cfg(uint8_t timer_index, uint8_t channel_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	timer_input_ch_configs[timer_index][channel_index].source = iocx_ex_timer_decode_ic_ch_src(&config);
	timer_input_ch_configs[timer_index][channel_index].active_edge = iocx_ex_timer_decode_ic_ch_active_edge(&config);
	timer_input_ch_configs[timer_index][channel_index].prescaler = iocx_ex_timer_decode_ic_ch_prescaler(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_Cfg2(uint8_t timer_index, uint8_t channel_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	timer_input_ch_configs[timer_index][channel_index].filter = iocx_ex_timer_decode_ic_ch_filter(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_StallCfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].stall_timeout_ms = iocx_ex_timer_decode_ic_stall_timeout(&config) * TIMER_INPUT_CH_SHALL_TIMEOUT_UNIT_MS;
	timer_inputcap_configs[timer_index].stall_action = iocx_ex_timer_decode_ic_stall_action(&config);
}

static void HAL_IOCX_TIMER_ConfigureInputCaptureChannel(uint8_t timer_index, uint8_t channel_index, TIM_IC_InitTypeDef *psConfigIC)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;

	/* Configure active edge(s) */
	switch (timer_input_ch_configs[timer_index][channel_index].active_edge) {
	case INPUT_CAPTURE_CH_ACTIVE_BOTH:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
		break;
	case INPUT_CAPTURE_CH_ACTIVE_FALLING:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
		break;
	case INPUT_CAPTURE_CH_ACTIVE_RISING:
	default:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
		break;
	}

	/* Configure Capture Source */
	TIMER_INPUT_CAPTURE_CH_SOURCE input_src = timer_input_ch_configs[timer_index][channel_index].source;
	if (((channel_index == 0) && (input_src == INPUT_CAPTURE_FROM_SIGNAL_B))||
		((channel_index == 1) && (input_src == INPUT_CAPTURE_FROM_SIGNAL_A))) {
		psConfigIC->ICSelection = TIM_ICSELECTION_INDIRECTTI;
	} else {
		psConfigIC->ICSelection = TIM_ICSELECTION_DIRECTTI;
	}

	/* Configure Input Prescaler */
	switch (timer_input_ch_configs[timer_index][channel_index].prescaler) {
	case INPUT_CAPTURE_PRESCALE_8x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV8;
		break;
	case INPUT_CAPTURE_PRESCALE_4x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV4;
		break;
	case INPUT_CAPTURE_PRESCALE_2x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV2;
		break;
	case INPUT_CAPTURE_PRESCALE_1x:
	default:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV1;
		break;
	}
	/* Configure Input Filter */
	psConfigIC->ICFilter = (uint32_t)timer_input_ch_configs[timer_index][channel_index].filter;
}

void HAL_IOCX_TIMER_INPUTCAP_Set_TimerCounterResetCfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	TIMER_COUNTER_INTERRUPT_RESET reset = iocx_ex_timer_decode_counter_reset_mode(&config);
	uint8_t reset_src = iocx_ex_timer_decode_counter_reset_source(&config);
	if (reset == TIMER_COUNTER_INTERRUPT_RESET_ENABLED) {
		if (reset_src < IOCX_NUM_INTERRUPTS) {
			IOCX_gpio_interrupt_timer_reset_targets[reset_src] = timer_index;
		}
	} else {
		IOCX_gpio_interrupt_timer_reset_targets[reset_src] = TIMER_RESET_DISABLED;
	}
}

void HAL_IOCX_TIMER_Set_Config(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&config);
	IOCX_QUAD_ENCODER_MODE qe_mode = iocx_decode_quad_encoder_mode(&config);

	if (mode != TIMER_MODE_QUAD_ENCODER) {
		ResetQEIntegrator(timer_index, 0 /* Disable */ );
	}

