kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
	switch(mode){
	case TIMER_MODE_DISABLED:
		HAL_IOCX_TIMER_Enable_Capture_Interrupt(timer_index,0);
		__HAL_TIM_DISABLE(timer_configs[timer_index].p_tim_handle);
		switch (iocx_decode_timer_mode(&curr_timer_cfg[timer_index])) {
		case TIMER_MODE_QUAD_ENCODER:
			HAL_TIM_Encoder_Stop(timer_configs[timer_index].p_tim_handle, BOTH_ENCODER_TIMER_CHANNELS);
			break;
		case TIMER_MODE_PWM_OUT:
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		case TIMER_MODE_INPUT_CAPTURE:
		{
			HAL_TIM_IC_Stop_IT(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_IC_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		}
		default:
			break;
		}
		break;

	case TIMER_MODE_QUAD_ENCODER:
		{
			// Prescaler must be already set before enabling.
			TIM_Encoder_InitTypeDef sConfig;
			TIM_MasterConfigTypeDef sMasterConfig;

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.Period = p_htim->Instance->ARR;
			if (qe_mode == QUAD_ENCODER_MODE_4x) {
				// A & B signal, both edges
				sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
			} else /* 1x or 2x */ {
				// A signal only.  Both edges are counted,
				// and if 1x the count is divided by two (later)
				sConfig.EncoderMode = TIM_ENCODERMODE_TI1;
			}
			qe_curr_mode[timer_index] = qe_mode;
			sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC1Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC2Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC1Filter    = (uint32_t)timer_input_ch_configs[timer_index][0].filter;
			sConfig.IC2Filter    = (uint32_t)timer_input_ch_configs[timer_index][1].filter;
			HAL_TIM_Encoder_Init(p_htim, &sConfig);

			/* Disable MasterSlave mode */
			sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
			sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
			HAL_TIMEx_MasterConfigSynchronization(p_htim, &sMasterConfig);

			/* Be sure to configure the auto-reload register (ARR) to the max possible value. */
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;

			ResetQEIntegrator(timer_index, 1 /* Enable */);

			HAL_TIM_Encoder_Start(p_htim, BOTH_ENCODER_TIMER_CHANNELS);
		}
		break;

	case TIMER_MODE_PWM_OUT:
		{
			TIM_OC_InitTypeDef sConfigOC;
			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			// Prescaler and Period must be already set before enabling.
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			HAL_TIM_PWM_Init(p_htim);

			// Periods (CCR) for both channels must be already set before enabling.
			sConfigOC.OCMode = TIM_OCMODE_PWM1;
			sConfigOC.Pulse = timer_channel_ccr[timer_index][0];
			sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
			sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].first_channel_number);
			sConfigOC.Pulse = timer_channel_ccr[timer_index][1];
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].second_channel_number);

			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].second_channel_number);
		}
		break;

	case TIMER_MODE_INPUT_CAPTURE:
		{
			// Inputcap, Inputcap channel settings must already be already set before enabling.
			// Prescaler must be already set before enabling.
			TIM_ClockConfigTypeDef sClockSourceConfig;
			TIM_SlaveConfigTypeDef sSlaveConfig;
			TIM_IC_InitTypeDef sConfigIC;
			TIM_MasterConfigTypeDef sMasterConfig;

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			switch (timer_inputcap_configs[timer_index].direction) {
			case TIMER_COUNTER_DIRECTION_DN:
				p_htim->Init.CounterMode = TIM_COUNTERMODE_DOWN;
				break;
			case TIMER_COUNTER_DIRECTION_UP:
			default:
				p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
				break;
			}
			p_htim->Init.Period = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.RepetitionCounter = 0;

			HAL_TIM_IC_Init(p_htim);

			switch (timer_inputcap_configs[timer_index].clk_source) {
			case TIMER_COUNTER_CLK_INTERNAL:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
				/* Note:  If internal clock is used, the maximum capture period is fixed. */
				/* max_period_ms = 1 * (65535 /(48000/HAL_IOCX_TIMER_Get_Normalized_Prescaler(timer_index)) */
				break;
			case TIMER_COUNTER_CLK_EDGEDETECT_CH1:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI1ED;
				break;
			case TIMER_COUNTER_CLK_FILTERED_CH2:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI2;
				break;
			case TIMER_COUNTER_CLK_FILTERED_CH1:
			default:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI1;
				break;
			}
			HAL_TIM_ConfigClockSource(p_htim, &sClockSourceConfig);

			switch (timer_inputcap_configs[timer_index].slavemode_trigger) {
			case TIMER_SLAVE_MODE_TRIGGER_EDGEDETECT_CH1:
				sSlaveConfig.InputTrigger = TIM_TS_TI1F_ED;
				break;
			case TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH2:
				sSlaveConfig.InputTrigger = TIM_TS_TI2FP2;
				break;
			case TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1:
			default:
				sSlaveConfig.InputTrigger = TIM_TS_TI1FP1;
				break;
			}

			switch (timer_inputcap_configs[timer_index].slavemode) {
			case TIMER_SLAVE_MODE_RESET:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_RESET;
				break;
			case TIMER_SLAVE_MODE_GATED:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_GATED;
				break;
			case TIMER_SLAVE_MODE_TRIGGER:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
				break;
			case TIMER_SLAVE_MODE_DISABLED:
			default:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_DISABLE;
				break;
			}
			/* ETR triggering is not supported; thus, these values are set to reasonable defaults. */
			sSlaveConfig.TriggerPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
			sSlaveConfig.TriggerPrescaler = TIM_ICPSC_DIV1;
			sSlaveConfig.TriggerFilter = 0;
			HAL_TIM_SlaveConfigSynchronization(p_htim, &sSlaveConfig);

